[
    {
        "name": "Capgemini",
        "startDate": "2020-02-01",
        "endDate": null,
        "roles": [
            {
                "name": "Senior Software Engineer",
                "startDate": null,
                "endDate": null,
                "description": "",
                "bulletPoints": [
                    "Expanded working knowledge to 27+ applications primarily Java based becoming the Subject Matter Expert (SME) for 15 of those applications.",
                    "Contributed to the seamless transition from legacy systems to Guidewire, with a primary emphasis on developing and enhancing Digital Portals catering to agents and customers across both Personal Auto and Commercial Auto.",
                    "Led and managed a team of offshore developers and business system analysts to maintain and enhance a portfolio of 37 client-owned applications.",
                    "Acted as Scrum Master for multiple teams while leveraging Agile principles and utilizing JIRA, including both Kanban and Scrum boards, to facilitate seamless collaboration and task management, thereby driving project success.",
                    "Collaborated extensively with business stakeholders and architects to design complex multi-system solutions, ensuring alignment with business goals and technical requirements.",
                    "Analyzed production trend data to detect and address systemic issues spanning a diverse array of applications, facilitating proactive identification and mitigation of emerging trends.",
                    "Implemented a standardized release management process adopted company-wide, ensuring streamlined coordination among development teams and transparent communication to stakeholders about production deployments."
                ],
                "keyMetrics": [
                    { "metric": "Production Deployments", "value": "111+" },
                    { "metric": "Enhancement Projects", "value": "81+" },
                    { "metric": "Fixes Implemented", "value": "329+" },
                    { "metric": "Applications Mastered", "value": "23" }
                ]
            }
        ]
    }
]